<template>
    <div class="xl:w-[1280px] xl:mx-auto px-2 md:px-4 xl:px-10 mt-[100px] md:mt-[170px] lg:mt-50 text-[15px] md:text-[24px] lg:text-[18px] flex flex-col gap-10 md:gap-15 lg:gap-10">
        <h1 ref="main" class="text-[46px] md:text-[85px] lg:text-[63px] font-semibold 
        leading-12 md:leading-20 lg:leading-16">ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ ОБ ОБРАБОТКЕ ПЕРСОНАЛЬНЫХ ДАННЫХ</h1>
        
        <div class="flex flex-col gap-5 md:max-lg:gap-8">
            <h2 class="text-[35px] md:text-[60px] lg:text-[45px] font-semibold">1. ОБЩИЕ ПОЛОЖЕНИЯ</h2>

            <div>
                Настоящее соглашение об обработке персональных данных составлено в соответствии с требованиями Федерального закона от 27.07.2006 №152-ФЗ «О персональных данных» (далее - Закон о персональных данных) и определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных. Присоединяясь к настоящему Соглашению, Субъект персональных данных выражает Согласие на обработку персональных данных и их передачу Оператору обработки персональных данных – ИП Анохин С. В. (ОГРН: 315301900003350, ИНН: 301606702671) - на следующих условиях. 
            </div>

            <div>
                1.1. Оператор ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну. 
            </div>

            <div>
                1.2. Настоящее Соглашение в отношении обработки персональных данных (далее – Соглашение) применяется ко всей информации, которую Оператор может получить о пользователях веб-сайта https://благодей30.рф (далее-Пользователь). 
            </div>

            <div>
                1.3. Использование Веб-сайта в любой форме, в том числе перемещение по сайту и изучение размещенных на нем материалов, заполнение форм сайта и предоставление информации о себе означает полное согласие Пользователя с условиями обработки его персональных данных, установленными настоящим Соглашением. Кроме того, выражение согласия с условиями Соглашения путем проставления соответствующей отметки («кружочка») на Веб-сайте является безоговорочным согласием Пользователя с настоящим Соглашением.
            </div>

            <div>

            </div>
        </div>
        
        <div class="flex flex-col gap-5 md:max-lg:gap-8">
            <h2 class="text-[35px] md:text-[60px] lg:text-[45px] font-semibold">2. ОСНОВНЫЕ ПОНЯТИЯ, ИСПОЛЬЗУЕМЫЕ В СОГЛАШЕНИИ</h2>

            <div>
                2.1. Автоматизированная обработка персональных данных – обработка персональных данных с помощью средств вычислительной техники. 
            </div>

            <div>
                2.2. Блокирование персональных данных – временное прекращение обработки персональных данных (за исключением случаев, если обработка необходима для уточнения персональных данных). 
            </div>

            <div>
                2.3. Веб-сайт – совокупность графических и информационных материалов, а также программ для ЭВМ и баз данных, обеспечивающих их доступность в сети интернет по сетевому адресу https://благодей30.рф. 
            </div>

            <div>
                2.4. Информационная система персональных данных — совокупность содержащихся в базах данных персональных данных, и обеспечивающих их обработку информационных технологий и технических средств. 
            </div>

            <div>
                2.5. Обезличивание персональных данных — действия, в результате которых невозможно определить без использования дополнительной информации принадлежность персональных данных конкретному Пользователю или иному субъекту персональных данных. 
            </div>

            <div>
                2.6. Обработка персональных данных – любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных. 
            </div>

            <div>
                2.7. Оператор – государственный орган, муниципальный орган, юридическое или физическое лицо, самостоятельно или совместно с другими лицами организующие и (или) осуществляющие обработку персональных данных, а также определяющие цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными. 
            </div>

            <div>
                2.8. Персональные данные – любая информация, относящаяся прямо или косвенно к определенному или определяемому Пользователю веб-сайта https://благодей30.рф. 
            </div>

            <div>
                2.9. Персональные данные, разрешенные субъектом персональных данных для распространения, - персональные данные, доступ неограниченного круга лиц к которым предоставлен субъектом персональных данных путем дачи согласия на обработку персональных данных, разрешенных субъектом персональных данных для распространения в порядке, предусмотренном Законом о персональных данных (далее - персональные данные, разрешенные для распространения). 
            </div>

            <div>
                2.10. Пользователь – любой посетитель веб-сайта https://благодей30.рф. 
            </div>

            <div>
                2.11. Предоставление персональных данных – действия, направленные на раскрытие персональных данных определенному лицу или определенному кругу лиц. 
            </div>

            <div>
                2.12. Распространение персональных данных – любые действия, направленные на раскрытие персональных данных неопределенному кругу лиц (передача персональных данных) или на ознакомление с персональными данными неограниченного круга лиц, в том числе обнародование персональных данных в средствах массовой информации, размещение в информационно-телекоммуникационных сетях или предоставление доступа к персональным данным каким-либо иным способом. 
            </div>

            <div>
                2.13. Уничтожение персональных данных – любые действия, в результате которых персональные данные уничтожаются безвозвратно с невозможностью дальнейшего восстановления содержания персональных данных в информационной системе персональных данных и (или) уничтожаются материальные носители персональных данных.
            </div>
        </div>

        <div class="flex flex-col gap-5 md:max-lg:gap-8">
            <h2 class="text-[35px] md:text-[60px] lg:text-[45px] font-semibold">3. ОСНОВНЫЕ ПРАВА И ОБЯЗАННОСТИ ОПЕРАТОРА</h2>

            <div class="flex flex-col gap-5 md:max-lg:gap-8">
                3.1. Оператор имеет право: 

                <div>
                    – получать от субъекта персональных данных достоверные информацию и/или документы, содержащие персональные данные;
                </div> 

                <div>
                    – в случае отзыва субъектом персональных данных согласия на обработку персональных данных Оператор вправе продолжить обработку персональных данных без согласия субъекта персональных данных при наличии оснований, указанных в Законе о персональных данных; 
                </div>
                
                <div>
                    – самостоятельно определять состав и перечень мер, необходимых и достаточных для обеспечения выполнения обязанностей, предусмотренных Законом о персональных данных и принятыми в соответствии с ним нормативными правовыми актами, если иное не предусмотрено Законом о персональных данных или другими федеральными законами. 
                </div>
            </div>

            <div class="flex flex-col gap-5 md:max-lg:gap-8">
                3.2. Оператор обязан: 

                <div>
                    – предоставлять субъекту персональных данных по его просьбе информацию, касающуюся обработки его персональных данных; 
                </div> 

                <div>
                    – организовывать обработку персональных данных в порядке, установленном действующим законодательством РФ; 
                </div>
                
                <div>
                    – отвечать на обращения и запросы субъектов персональных данных и их законных представителей в соответствии с требованиями Закона о персональных данных; 
                </div>

                <div>
                    – сообщать в уполномоченный орган по защите прав субъектов персональных данных по запросу этого органа необходимую информацию в течение 30 дней с даты получения такого запроса; 
                </div>

                <div>
                    – публиковать или иным образом обеспечивать неограниченный доступ к настоящему Соглашению в отношении обработки персональных данных; 
                </div>

                <div>
                    – прекратить передачу (распространение, предоставление, доступ) персональных данных, прекратить обработку и уничтожить персональные данные в порядке и случаях, предусмотренных Законом о персональных данных; 
                </div>

                <div>
                    – исполнять иные обязанности, предусмотренные Законом о персональных данных.
                </div>
            </div>
        </div>

        <div class="flex flex-col gap-5 md:max-lg:gap-8">
            <h2 class="text-[35px] md:text-[60px] lg:text-[45px] font-semibold">4. ОСНОВНЫЕ ПРАВА И ОБЯЗАННОСТИ СУБЪЕКТОВ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>

            <div class="flex flex-col gap-5">
                4.1. Субъекты персональных данных имеют право: 

                <div>
                    – получать информацию, касающуюся обработки его персональных данных, за исключением случаев, предусмотренных федеральными законами. Сведения предоставляются субъекту персональных данных Оператором в доступной форме, и в них не должны содержаться персональные данные, относящиеся к другим субъектам персональных данных, за исключением случаев, когда имеются законные основания для раскрытия таких персональных данных. Перечень информации и порядок ее получения установлен Законом о персональных данных; 
                </div> 

                <div>
                    – требовать от оператора уточнения его персональных данных, их блокирования или уничтожения в случае, если персональные данные являются неполными, устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной цели обработки, а также принимать предусмотренные законом меры по защите своих прав; 
                </div>
                
                <div>
                    – выдвигать условие предварительного согласия при обработке персональных данных в целях продвижения на рынке товаров, работ и услуг;
                </div>

                <div>
                    – на отзыв согласия на обработку персональных данных; 
                </div>

                <div>
                    – обжаловать в уполномоченный орган по защите прав субъектов персональных данных или в судебном порядке неправомерные действия или бездействие Оператора при обработке его персональных данных; 
                </div>

                <div>
                    – на осуществление иных прав, предусмотренных законодательством РФ.
                </div>
            </div>

            <div class="flex flex-col gap-5">
                4.2. Субъекты персональных данных обязаны: 

                <div>
                    – предоставлять Оператору достоверные данные о себе; 
                </div> 

                <div>
                    – сообщать Оператору об уточнении (обновлении, изменении) своих персональных данных. 
                </div>
            </div>

            <div>
                4.3. Лица, передавшие Оператору недостоверные сведения о себе, либо сведения о другом субъекте персональных данных без согласия последнего, несут ответственность в соответствии с законодательством РФ.
            </div>
        </div>

        <div class="flex flex-col gap-5 md:max-lg:gap-8">
            <h2 class="text-[35px] md:text-[60px] lg:text-[45px] font-semibold">5. ОБРАБОТКА ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>

            <div class="flex flex-col gap-5 md:max-lg:gap-8">
                5.1. Перечень персональных данных, на обработку которых дается согласие: 

                <div>
                    - фамилия, имя, отчество;
                </div> 

                <div>
                    - номера телефонов.
                </div>
            </div>

            <div>
                5.2. Также на сайте происходит сбор и обработка обезличенных данных о посетителях (в т.ч. файлов «cookie») с помощью сервисов интернет-статистики («Яндекс Вебмастер»). 
            </div>

            <div>
                5.3. Вышеперечисленные данные далее по тексту Соглашения объединены общим понятием Персональные данные. 
            </div>

            <div>
                5.4. Обработка специальных категорий персональных данных, касающихся расовой, национальной принадлежности, политических взглядов, религиозных или философских убеждений, интимной жизни, Оператором не осуществляется. 
            </div>

            <div>
                5.5. Обработка персональных данных, разрешенных для распространения, из числа специальных категорий персональных данных, указанных в ч. 1 ст. 10 Закона о персональных данных, допускается, если соблюдаются запреты и условия, предусмотренные ст. 10.1 Закона о персональных данных. 
            </div>

            <div>
                5.6. Согласие Пользователя на обработку персональных данных, разрешенных для распространения, оформляется отдельно от других согласий на обработку его персональных данных. При этом соблюдаются условия, предусмотренные, в частности, ст. 10.1 Закона о персональных данных. Требования к содержанию такого согласия устанавливаются уполномоченным органом по защите прав субъектов персональных данных. 
            </div>

            <div>
                5.6.1 Согласие на обработку персональных данных, разрешенных для распространения, Пользователь предоставляет Оператору непосредственно.
            </div>

            <div>
                5.6.2 Оператор обязан в срок не позднее трех рабочих дней с момента получения указанного согласия Пользователя опубликовать информацию об условиях обработки, о наличии запретов и условий на обработку неограниченным кругом лиц персональных данных, разрешенных для распространения. 
            </div>

            <div>
                5.6.3 Передача (распространение, предоставление, доступ) персональных данных, разрешенных субъектом персональных данных для распространения, должна быть прекращена в любое время по требованию субъекта персональных данных. Данное требование должно включать в себя фамилию, имя, отчество (при наличии), контактную информацию (номер телефона, адрес электронной почты или почтовый адрес) субъекта персональных данных, а также перечень персональных данных, обработка которых подлежит прекращению. Указанные в данном требовании персональные данные могут обрабатываться только Оператором, которому оно направлено. 
            </div>

            <div>
                5.6.4 Согласие на обработку персональных данных, разрешенных для распространения, прекращает свое действие с момента поступления Оператору требования, указанного в п. 5.9.3 настоящего Соглашения в отношении обработки персональных данных
            </div>
        </div>

        <div class="flex flex-col gap-5 md:max-lg:gap-8">
            <h2 class="text-[35px] md:text-[60px] lg:text-[45px] font-semibold">6. ПРИНЦИПЫ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>

            <div>
                6.1. Обработка персональных данных осуществляется на законной и справедливой основе. 
            </div>

            <div>
                6.2. Обработка персональных данных ограничивается достижением конкретных, заранее определенных и законных целей. Не допускается обработка персональных данных, несовместимая с целями сбора персональных данных.
            </div>

            <div>
                6.3. Не допускается объединение баз данных, содержащих персональные данные, обработка которых осуществляется в целях, несовместимых между собой. 
            </div>

            <div>
                6.4. Обработке подлежат только персональные данные, которые отвечают целям их обработки. 
            </div>

            <div>
                6.5. Содержание и объем обрабатываемых персональных данных соответствуют заявленным целям обработки. Не допускается избыточность обрабатываемых персональных данных по отношению к заявленным целям их обработки. 
            </div>

            <div>
                6.6. При обработке персональных данных обеспечивается точность персональных данных, их достаточность, а в необходимых случаях и актуальность по отношению к целям обработки персональных данных. Оператор принимает необходимые меры и/или обеспечивает их принятие по удалению или уточнению неполных или неточных данных. 
            </div>
        </div>

        <div class="flex flex-col gap-5 md:max-lg:gap-8">
            <h2 class="text-[35px] md:text-[60px] lg:text-[45px] font-semibold">7. ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>

            <div class="flex flex-col gap-5">
                7.1. Цель обработки персональных данных Пользователя: 

                <div>
                    - информирование Пользователя;
                </div> 

                <div>
                    - проведение статистических и иных исследований, на основе обезличенных данных; 
                </div>
            </div>

            <div>
                7.2. Обезличенные данные Пользователей, собираемые с помощью сервисов интернет-статистики, служат для сбора информации о действиях Пользователей на сайте, улучшения качества сайта и его содержания.
            </div>
        </div>

        <div class="flex flex-col gap-5 md:max-lg:gap-8">
            <h2 class="text-[35px] md:text-[60px] lg:text-[45px] font-semibold">8. ПРАВОВЫЕ ОСНОВАНИЯ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>

            <div class="flex flex-col gap-5">
                8.1. Правовыми основаниями обработки персональных данных Оператором являются: 

                <div>
                    – Конституция Российской Федерации; 
                </div> 

                <div>
                    – Гражданский кодекс Российской Федерации; 
                </div>

                <div>
                    – Федеральный закон от 27.07.2006 г. № 152-ФЗ «О персональных данных»; 
                </div>

                <div>
                    – Федеральный закон от 27.07.2006 г. № 149-ФЗ «Об информации, информационных технологиях и о защите информации»; 
                </div>

                <div>
                    – Федеральный закон от 06.04.2011 г. № 63-ФЗ «Об электронной подписи»; 
                </div>

                <div>
                    – Федеральный закон от 07.07.2003 г. № 126-ФЗ «О связи»; 
                </div>

                <div>
                    – Постановление Правительства Российской Федерации от 01.11.2012 г. № 1119 «Об утверждении требований к защите персональных данных при их обработке в информационных системах персональных данных»; 
                </div>

                <div>
                    – Постановление Правительства Российской Федерации от 15.09.2008 г. № 687 «Об утверждении Положения об особенностях обработки персональных данных, осуществляемой без использования средств автоматизации»; 
                </div>

                <div>
                    – иными нормативными правовыми актами.
                </div>

                <div>
                    – уставные документы Оператора; 
                </div>

                <div>
                    – договоры, заключаемые между оператором и субъектом персональных данных; 
                </div>

                <div>
                    – согласия Пользователей на обработку их персональных данных, на обработку персональных данных, разрешенных для распространения. 
                </div>
            </div>

            <div>
                8.2. Обработка персональных данных будет осуществляться путем смешанной (автоматизированной, не автоматизированной) обработки персональных данных. Оператор обрабатывает персональные данные Пользователя только в случае выражение согласия с условиями Соглашения путем проставления соответствующей отметки («кружочка») на Веб-сайте, что является безоговорочным согласием Пользователя с настоящим Соглашением.
            </div>

            <div>
                8.3. Оператор обрабатывает обезличенные данные о Пользователе в случае, если это разрешено в настройках браузера Пользователя (включено сохранение файлов «cookie» и использование технологии JavaScript). 
            </div>

            <div>
                8.4. Субъект персональных данных самостоятельно принимает решение о предоставлении его персональных данных и дает согласие свободно, своей волей и в своем интересе.
            </div>
        </div>

        <div class="flex flex-col gap-5 md:max-lg:gap-8">
            <h2 class="text-[35px] md:text-[60px] lg:text-[45px] font-semibold">9. УСЛОВИЯ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>

            <div>
                9.1. Обработка персональных данных осуществляется с согласия субъекта персональных данных на обработку его персональных данных. 
            </div>

            <div>
                9.2. Обработка персональных данных необходима для достижения целей, предусмотренных международным договором Российской Федерации или законом, для осуществления возложенных законодательством Российской Федерации на оператора функций, полномочий и обязанностей. 
            </div>

            <div>
                9.3. Обработка персональных данных необходима для осуществления правосудия, исполнения судебного акта, акта другого органа или должностного лица, подлежащих исполнению в соответствии с законодательством Российской Федерации об исполнительном производстве.
            </div>

            <div>
                9.4. Обработка персональных данных необходима для исполнения договора, стороной которого либо выгодоприобретателем или поручителем по которому является субъект персональных данных, а также для заключения договора по инициативе субъекта персональных данных или договора, по которому субъект персональных данных будет являться выгодоприобретателем или поручителем. 
            </div>

            <div>
                9.5. Обработка персональных данных необходима для осуществления прав и законных интересов оператора или третьих лиц либо для достижения общественно значимых целей при условии, что при этом не нарушаются права и свободы субъекта персональных данных. 
            </div>

            <div>
                9.6. Осуществляется обработка персональных данных, доступ неограниченного круга лиц к которым предоставлен субъектом персональных данных либо по его просьбе (далее – общедоступные персональные данные).
            </div>

            <div>
                9.7. Осуществляется обработка персональных данных, подлежащих опубликованию или обязательному раскрытию в соответствии с федеральным законом. 
            </div>

            <div>
                9.8. Настоящее согласие на обработку персональных данных действует до момента востребования Пользователя - письменным отзывом в произвольной форме.
            </div>
        </div>

        <div class="flex flex-col gap-5 md:max-lg:gap-8">
            <h2 class="text-[35px] md:text-[60px] lg:text-[45px] font-semibold">10. ПОРЯДОК СБОРА, ХРАНЕНИЯ, ПЕРЕДАЧИ И ДРУГИХ ВИДОВ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h2>

            <div>
                10.1. В случае выявления неточностей в персональных данных, Пользователь может актуализировать их самостоятельно, путем направления Оператору уведомление на адрес электронной почты Оператора <a href="mailto:blagodei30@yandex.ru" class="underline">blagodei30@yandex.ru</a> с пометкой «Актуализация персональных данных». 
            </div>

            <div>
                10.2. Пользователь имеет право в любой момент отозвать свое согласие на обработку персональных данных, направив Оператору уведомление посредством электронной почты на электронный адрес Оператора <a href="mailto:blagodei30@yandex.ru" class="underline">blagodei30@yandex.ru</a> с пометкой «Отзыв согласия на обработку персональных данных». 
            </div>

            <div>
                10.3. Вся информация, которая собирается сторонними сервисами, в том числе платежными системами, средствами связи и другими поставщиками услуг, хранится и обрабатывается указанными лицами (Операторами) в соответствии с их Пользовательским соглашением и Политикой конфиденциальности. Субъект персональных данных и/или Пользователь обязан самостоятельно своевременно ознакомиться с указанными документами. Оператор не несет ответственность за действия третьих лиц, в том числе указанных в настоящем пункте поставщиков услуг. 
            </div>

            <div>
                10.4. Установленные субъектом персональных данных запреты на передачу (кроме предоставления доступа), а также на обработку или условия обработки (кроме получения доступа) персональных данных, разрешенных для распространения, не действуют в случаях обработки персональных данных в государственных, общественных и иных публичных интересах, определенных законодательством РФ. 
            </div>

            <div>
                10.5. Условием прекращения обработки персональных данных может являться достижение целей обработки персональных данных, истечение срока действия согласия субъекта персональных данных или отзыв согласия субъектом персональных данных, а также выявление неправомерной обработки персональных данных.
            </div>
        </div>

        <div class="flex flex-col gap-5 md:max-lg:gap-8">
            <h2 class="text-[35px] md:text-[60px] lg:text-[45px] font-semibold">11. ПЕРЕЧЕНЬ ДЕЙСТВИЙ, ПРОИЗВОДИМЫХ ОПЕРАТОРОМ С ПОЛУЧЕННЫМИ ПЕРСОНАЛЬНЫМИ ДАННЫМИ</h2>

            <div>
                11.1. Оператор осуществляет сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление и уничтожение персональных данных. 
            </div>

            <div>
                11.2. Оператор осуществляет автоматизированную обработку персональных данных с получением и/или передачей полученной информации по информационно-телекоммуникационным сетям или без таковой. 
            </div>

            <div>
                11.3. Оператор вправе поручить обработку персональных данных другому лицу. Лицо, осуществляющее обработку персональных данных по поручению Оператора, обязано соблюдать принципы и правила обработки персональных данных, предусмотренные ФЗ-152 и настоящим Соглашением.
            </div>
        </div>

        <div class="flex flex-col gap-5 md:max-lg:gap-8">
            <h2 class="text-[35px] md:text-[60px] lg:text-[45px] font-semibold">12. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</h2>

            <div>
                12.1. Пользователь может получить любые разъяснения по интересующим вопросам, касающимся обработки его персональных данных, обратившись к Оператору с помощью электронной почты <a href="mailto:blagodei30@yandex.ru" class="underline">blagodei30@yandex.ru</a>. 
            </div>

            <div>
                12.2. В данном документе будут отражены любые изменения соглашения об обработке персональных данных Оператором. Соглашение действует бессрочно до замены его новой версией. 
            </div>

            <div>
                12.3. Актуальная версия Соглашения в свободном доступе расположена в сети Интернет по адресу https://благодей30.рф.
            </div>
        </div>
    </div>
</template>

<script setup>
import { useTemplateRef } from 'vue';
import eventBus from '@/eventBus';
import { onMounted } from 'vue';

let refMain = useTemplateRef('main')
document.body.scrollTop = 0

onMounted(() => {
  eventBus.emit('refMain', refMain) // to navBar.vue
})
</script>