<template>
    <div class="xl:w-[1280px] xl:mx-auto px-2 md:px-4 xl:px-10 mt-[100px] md:mt-[170px] lg:mt-50 text-[15px] md:text-[24px] lg:text-[18px] flex flex-col gap-10 md:gap-15 lg:gap-10">
        <h1 ref="main" class="text-[46px] md:text-[85px] lg:text-[63px] font-semibold 
        leading-12 md:leading-20 lg:leading-16">УСЛОВИЯ ИСПОЛЬЗОВАНИЯ ФАЙЛОВ COOKIE</h1>
        
        <div class="flex flex-col gap-5 md:max-lg:gap-8">
            <div>
                На сайте https://благодей30.рф и его поддоменах (далее — Сайт) используются файлы cookie.
            </div>

            <div>
                Файлы cookie — это небольшие текстовые файлы, которые после просмотра Пользователем фрагментов Сайта сохраняются на его устройстве.
            </div>

            <div>
                Использование файлов cookie позволяет «благодей30.рф» (далее – Оператор) контролировать доступность Сайта, анализировать данные, а также понимать, как развивать оказываемые услуги.
            </div>

            <div>
                На Сайте используются следующие типы файлов cookie:
            </div>

            <div>
                1. Технические файлы cookie: они необходимы для корректной работы Сайта и вспомогательных сервисов. Такие файлы cookie позволяют определять аппаратное и программное обеспечение устройства Пользователя; выявлять ошибки при работе Сайта; тестировать новые функции для повышения производительности Сайта.
            </div>

            <div>
                2. Аналитические файлы cookie: они позволяют подсчитывать количество Пользователей Сайта; определять, какие действия Пользователь совершает на Сайте (посещаемые страницы, время и количество просмотренных страниц). Сбор аналитических данных осуществляется через партнеров, в том числе Яндекс Вебмастер.
            </div>

            <div>
                Срок хранения файлов cookie зависит от конкретного типа, но в любом случае не превышает срока, необходимого для достижения целей обработки персональных данных.
            </div>

            <div>
                При посещении Сайта Оператор запрашивает согласие Пользователя на использование файлов cookie.
            </div>

            <div>
                Для прекращения обработки файлов cookie Пользователь может изменить настройки используемых браузеров на всех устройствах (компьютер, мобильные устройства).
            </div>

            <div>
                ВАЖНО: при отказе от использования файлов cookie отдельные функции Сайта могут быть недоступными, что повлияет на возможность использования Сайта.
            </div>
        </div>
    </div>
</template>

<script setup>
document.body.scrollTop = 0
</script>